Leafony/platformio-sample-projects/stm32/STM32_Logger_Beacon/src/main.cpp
  // AD Structure 2 (Complete Local Name)
  adv_data[index++] = strDeviceName.length() + 1;           // field length
  adv_data[index++] = BGLIB_GAP_AD_TYPE_LOCALNAME_COMPLETE; // AD Type (Complete Local Name)
  for (uint8_t i = 0; i < strDeviceName.length(); i++) {
    adv_data[index++] = strDeviceName.charAt(i); // Local Name
  }

  // AD Structure 3 (Manufacturer Specific Data)
  adv_data[index++] = 9;    // field lengh
  adv_data[index++] = 0xff; // AD Type (Manufacturer Specific Data)
  adv_data[index++] = (illum >> 8) & 0xFF;    // Illuminance (Upper)
  adv_data[index++] = illum & 0xFF;           // Illuminance (Lower)
  adv_data[index++] = (temp >> 8) & 0xFF;     // Temperature (Upper)
  adv_data[index++] = temp & 0xFF;            // Temperature (Lower)
  adv_data[index++] = (humid >> 8) & 0xFF;    // Humidity (Upper)
  adv_data[index++] = humid & 0xFF;           // Humidity (Lower)
  adv_data[index++] = (battVolt >> 8) & 0xFF; // Battery Voltage (Upper)
  adv_data[index++] = battVolt & 0xFF;        // Battery Boltage (Lower)

  // register advertising packet
  stLen = index;
  ble112.ble_cmd_le_gap_set_adv_data(SCAN_RSP_ADVERTISING_PACKETS, stLen, adv_data);
  while (ble112.checkActivity(1000));

  // index = 0  LE_GAP_SCANNABLE_NON_CONNECTABLE / LE_GAP_UNDIRECTED_CONNECTABLE
  ble112.ble_cmd_le_gap_start_advertising(0, LE_GAP_USER_DATA, LE_GAP_UNDIRECTED_CONNECTABLE);
  while (ble112.checkActivity(1000));
}


//-----------------------------------------------
// Sensors initialization
//-----------------------------------------------
void setupSensors() {
#ifdef DEBUG
  Serial.println("Initializing sensors...");
#endif

  // LIS2DH (accelerometer)
  accel.begin(LIS2DH_ADDRESS);
  accel.setRange(LIS3DH_RANGE_2_G);  // Full scale +/- 2G
  accel.setDataRate(LIS3DH_DATARATE_50_HZ);  // Data rate = 10Hz
  accel.setClick(DOUBLE_TAP, CLICK_THRESHOLD);  // enable click interrupt

  // enable interrupt from accelerometer click event
  LowPower.attachInterruptWakeup(INT_1, onClicked, RISING, DEEP_SLEEP_MODE);

  // HTS221 (temperature /humidity)
  smeHumidity.begin();

  // OPT3001 (light)
  OPT3001_Config newConfig;
  OPT3001_ErrorCode errorConfig;
  light.begin(OPT3001_ADDRESS);
  newConfig.RangeNumber = B1100;             // automatic full scale
  newConfig.ConvertionTime = B0;             // convertion time = 100ms
  newConfig.ModeOfConversionOperation = B01; // single-shot conversion
  newConfig.Latch = B0;                      // hysteresis-style
  errorConfig = light.writeConfig(newConfig);

  delay(100); // wait until all sensors are ready

#ifdef DEBUG
  Serial.println("Sensors initialized.");
#endif
}


//--------------------------------------------------------------------
// Get sensors values
//--------------------------------------------------------------------
void getSensors() {
  // HTS221 (temperature & humidity)
  smeHumidity.begin();
  dataTemp = (float)smeHumidity.readTemperature();
  dataHumid = (float)smeHumidity.readHumidity();

  //--------------------
  // 2点補正用データ
  //--------------------
  // 温度補正用データ0
  float TL0 = 25.0;     // 4-Sensors温度測定値
  float TM0 = 25.0;     // 温度計等測定値
  // 温度補正用データ1
  float TL1 = 40.0;     // 4-Sensors温度測定値
  float TM1 = 40.0;     // 温度計等測定値
  // 湿度補正用データ0
  float HL0 = 60.0;     // 4-Sensors湿度測定値
  float HM0 = 60.0;     // 湿度計等測定値
  // 湿度補正用データ1
  float HL1 = 80.0;     // 4-Sensors湿度測定値
  float HM1 = 80.0;     // 湿度計等測定値
  //-------------------------
  // 温度と湿度の2点補正
  //-------------------------
  dataTemp=TM0+(TM1-TM0)*(dataTemp-TL0)/(TL1-TL0);      // 温度補正
  dataHumid=HM0+(HM1-HM0)*(dataHumid-HL0)/(HL1-HL0);    // 湿度補正

  // if (dataHumid >= 100)
  // {
  //  dataHumid=100;
  // }

  // OPT3001 (illuminance)
  delay(100);
  OPT3001 result = light.readResult();
  dataLight = result.lux;

  // ADC081C027（ADC) battery voltage
  uint8_t adcVal1 = 0;
  uint8_t adcVal2 = 0;

  Wire.beginTransmission(BATT_ADC_ADDR);
  Wire.write(0x00);
  Wire.endTransmission(false);
  Wire.requestFrom(BATT_ADC_ADDR, 2);
  adcVal1 = Wire.read();
  adcVal2 = Wire.read();

  //測定値がFFならバッテリリーフはつながっていない
  if (adcVal1 == 0xff && adcVal2 == 0xff) {
    adcVal1 = adcVal2 = 0;
  }

  //電圧計算　ADC　* （(リファレンス電圧(3.3V)/ ADCの分解能(256)) * 分圧比（2倍））
  double temp_mv = ((double)((adcVal1 << 4) | (adcVal2 >> 4)) * 3300 * 2) / 256;
  dataBatt = (float)(temp_mv / 1000);

#ifdef DEBUG
  Serial.println("");
  Serial.println("--- sensors data ---");
  Serial.println("  Tmp[degC]     = " + String(dataTemp));
  Serial.println("  Hum[%]        = " + String(dataHumid));
  Serial.println("  Lum[lx]       = " + String(dataLight));
  Serial.println("  Bat[V]        = " + String(dataBatt));
  Serial.println("");
#endif
}

//-----------------------------------------
// sleep sensors
// センサーリーフをスリープさせる
//-----------------------------------------
void sleepSensors() {
  // HTS221 sleep
  smeHumidity.deactivate();

  // OPT3001 sleep
  OPT3001_Config newConfig;
  OPT3001_ErrorCode errorConfig;
  newConfig.ModeOfConversionOperation = B00;
  errorConfig = light.writeConfig(newConfig);
}

//-----------------------------------------
// wakeup sensors
// センサーリーフをスリープから復帰させる
//-----------------------------------------
void wakeupSensors() {
#ifdef DEBUG
  Serial.println(F("Wakeup Sensors."));
#endif

  // HTS221 wakeup
  smeHumidity.activate();

  // OPT3001 wakeup
  OPT3001_Config newConfig;
  OPT3001_ErrorCode errorConfig;
  newConfig.RangeNumber = B1100;  // automatic full scale
  newConfig.ModeOfConversionOperation = B01; //single-shot conversion
  errorConfig = light.writeConfig(newConfig);
  delay(300);
}

//---------------------------------------
// sleep BLE
// BLE リーフをスリープさせる
//---------------------------------------
void sleepBLE() {
#ifdef DEBUG
  Serial.println("Sleep BLE");
#endif

  ble112.ble_cmd_le_gap_stop_advertising(0);
  while (ble112.checkActivity());

  ble112.ble_cmd_system_halt(1);
  while (ble112.checkActivity());
  digitalWrite(BLE_WAKEUP, LOW);
}

//---------------------------------------
// wakeup BLE
// BLEリーフをスリープから復帰させる
//---------------------------------------
void wakeupBLE() {
#ifdef DEBUG
  Serial.println("Wakeup BLE");
#endif

  digitalWrite(BLE_WAKEUP, HIGH);
  delay(10);

