Leafony/platformio-sample-projects/stm32/STM32_Logger_Beacon/src/main.cpp
  ble112.ble_cmd_system_halt(0);
  while (ble112.checkActivity());

  ble112.ble_cmd_le_gap_set_adv_parameters(MIN_ADV_INTVAL, MAX_ADV_INTVAL, 7); /* [BGLIB] <interval_min> <interval_max> <channel_map> */
  while (ble112.checkActivity());
}

//---------------------------------------
// EEPROM
//
// Address Map
//   Addr, Description
//   0, EEPROM Configuration Check (if 0xAA: EEPROM is configured)
//   1, EEPROM Configuration Check (if 0xAA: EEPROM is configured)
//   2, Wake Interval (Upper)
//   3, Wake Interval (Lower)
//   4, Sleep Interval (Upper)
//   5, Sleep Interval (Lower)
//   6, Sens Frequency (Upper)
//   7, Sens Frequency (Lower)
//   8, Save Frequency (Upper)
//   9, Save Frequency (Lower)
//   10-11, Reserved
//   12, Device Name [0]
//   13, Device Name [1]
//   14, Device Name [2]
//   15, Device Name [3]
//   16, Device Name [4]
//   17-19, Reserved
//---------------------------------------
void setupEEPROM() {
  bool eeprom_configured = false;

  // EEPROM Configuration Check
  if (EEPROM.read(0) == 0xAA && EEPROM.read(1) == 0xAA) {
    #ifdef DEBUG
    Serial.println("EEPROM is already configured!");
    #endif
    eeprom_configured = true;
  } else {
    #ifdef DEBUG
    Serial.println("EEPROM is not configured. All variables are set to default.");
    #endif
  }

  if (eeprom_configured) {
    // Load saved registers
    // wake_intval  = (EEPROM.read(2) << 8) + EEPROM.read(3); // Reserved
    sleep_intval = (EEPROM.read(4) << 8) + EEPROM.read(5);
    // sens_freq    = (EEPROM.read(6) << 8) + EEPROM.read(7); // Reserved
    // save_freq    = (EEPROM.read(8) << 8) + EEPROM.read(9); // Reserved

    // Load device name
    strDeviceName = strDeviceNamePrefix;
    for (uint8_t i=0; i<5; i++){
      char c = EEPROM.read(12+i);
      // c is NOT alphabet or numeric
      if (!((c>='a' && c<='z') || (c>='A' && c<='Z') || (c>='0' && c<='9'))) {
        if (i==0) {  // Device Name is not set.
          strDeviceName += strDeviceNameUnique; // Set default unique name.
        }
        break;
      }
      // c is alphabet or numeric
      else {
        strDeviceName += String(c);
      }
    }
#ifdef DEBUG
    Serial.print("BLE Device Name is ");
    Serial.println(strDeviceName);
#endif

  } else {
    // Set default value
    wake_intval = DEFAULT_WAKE_INTERVAL;
    sleep_intval = DEFAULT_SLEEP_INTERVAL;
    sens_freq = DEFAULT_SENS_FREQ;
    save_freq = DEFAULT_SAVE_FREQ;

    // Save default value
    EEPROM.write(2, (wake_intval >> 8) & 0xFF);
    EEPROM.write(3, (wake_intval & 0xFF));
    EEPROM.write(4, (sleep_intval >> 8) & 0xFF);
    EEPROM.write(5, (sleep_intval & 0xFF));
    EEPROM.write(6, (sens_freq >> 8) & 0xFF);
    EEPROM.write(7, (sens_freq & 0xFF));
    EEPROM.write(8, (save_freq >> 8) & 0xFF);
    EEPROM.write(9, (save_freq & 0xFF));
    EEPROM.write(0, 0xAA); // EEPROM configured
    EEPROM.write(1, 0xAA); // EEPROM configured
  }

  // EEPROM Test
  for (uint16_t rb_work; rb_work < EEPROM.length(); rb_work++) {
    EEPROM.read(rb_work);
  }

  // when address is invalid;
  if (rb_addr >= EEPROM.length() || (rb_addr - RINGBUFF_OFFSET_ADDR) % PACKET_LENGTH != 0) {
    rb_addr = RINGBUFF_OFFSET_ADDR;
  }

#ifdef DEBUG
  Serial.print("EEPROM length: ");
  Serial.println(EEPROM.length());
  Serial.print("Ring buffer read address: ");
  Serial.println(rb_addr);
  Serial.print("WAKE_INTERVAL: ");
  Serial.print(wake_intval);
  Serial.println(" seconds");
  Serial.print("SLEEP_INTERVAL: ");
  Serial.print(sleep_intval);
  Serial.println(" seconds");
  // Serial.print("SENS_FREQ = ");
  // Serial.println(sens_freq);
  // Serial.print("SAVE_FREQ = ");
  // Serial.println(save_freq);
#endif
}

/**
 * 
 */
void writeEEPROM() {
  uint16_t temp, humid, illum, battVolt;
  uint32_t u_time;

  if (!rtc.isTimeSet()) {
    // RTC is not set, skip to save data.
    return;
  }

  // Get current time from RTC
  u_time = getTimestamp();

  // Reset the ring buffer address when the size is not enough;
  if (rb_addr + PACKET_LENGTH >= EEPROM.length()) {
    rb_addr = RINGBUFF_OFFSET_ADDR;
  }

#ifdef DEBUG
  Serial.println("");
  Serial.print("writeEEPROM(): ADDR=");
  Serial.print(rb_addr);
  Serial.print(", timestamp=");
  Serial.println(u_time);
#endif

  // Write the sensors data to EEPROM.
  temp = (uint16_t)(dataTemp * 256.0);
  humid = (uint16_t)(dataHumid * 256.0);
  illum = (uint16_t)dataLight;
  battVolt = (uint16_t)(dataBatt * 256.0);

  uint8_t data[12];
  data[0]  = (temp >> 8) & 0xFF;
  data[1]  = temp & 0xFF;
  data[2]  = (humid >> 8) & 0xFF;
  data[3]  = humid & 0xFF;
  data[4]  = (illum >> 8) & 0xFF;
  data[5]  = illum & 0xFF;
  data[6]  = (battVolt >> 8) & 0xFF;
  data[7]  = battVolt & 0xFF;
  data[8]  = (u_time >> 0) & 0xFF;
  data[9]  = (u_time >> 8) & 0xFF;
  data[10] = (u_time >> 16) & 0xFF;
  data[11] = (u_time >> 24) & 0xFF;

  for (uint8_t i = 0; i < 12; i++) {
    EEPROM.write(rb_addr + i, data[i]);
    delay(10);  // EEPROM書き込み後しばらく待つ
  }

  // write next ring buffer address to RTC backup register.
  rb_addr += PACKET_LENGTH;

#ifdef DEBUG
  Serial.print("{ temp = ");
  Serial.print(temp);
  Serial.print(", humid = ");
  Serial.print(humid);
  Serial.print(", illum = ");
  Serial.print(illum);
  Serial.print(", batt = ");
  Serial.print(battVolt);
  Serial.println(" }");
  Serial.print("Next ringbuffer address: ");
  Serial.println(rb_addr);
  Serial.println("");
#endif
}

/**
 * decode RTC to timestamp.
 */
uint32_t getTimestamp() {
  if (!rtc.isTimeSet()) {
    return 0;
  }

  uint8_t year = rtc.getYear();
  uint8_t month = rtc.getMonth();
  uint8_t day = rtc.getDay();
  uint8_t hours = rtc.getHours();
  uint8_t minutes = rtc.getMinutes();
  uint8_t seconds = rtc.getSeconds();

#ifdef DEBUG
  Serial.print("RTC Timestamp: ");
  Serial.print(year + 2000);
  Serial.print("/");
  Serial.print(month);
  Serial.print("/");
  Serial.print(day);
  Serial.print(" ");
  Serial.print(hours);
  Serial.print(":");
  Serial.print(minutes);
  Serial.print(":");
  Serial.print(seconds);
  Serial.println(" (GMT+0)");
#endif
  DateTime date (year, month, day, hours, minutes, seconds);
  return date.unixtime();
}

/**
 * 
 */
void sleepAllDevices() {
  sleepBLE();
  sleepSensors();

#ifdef DEBUG
  Serial.print(">>> STM32 deepsleep (restart after ");
  Serial.print(sleep_intval);
  Serial.println(" seconds) >>>");
  Serial.flush();
#endif

  LowPower.deepSleep(sleep_intval * 1000);
}

/**
 * 
 */
void setup() {
  Serial.begin(SERIAL_BAUD);
  LowPower.begin(); // Configure low power

