Leafony/platformio-sample-projects/stm32/STM32_Logger_Beacon/src/main.cpp
  Wire.begin(); // I2C 100KHz
  rtc.begin(); // initialize RTC 24H format

#ifdef DEBUG
  Serial.print("FIRMWARE VERSION: ");
  Serial.println(FIRMWARE_VERSION);
  Serial.print("CPU Clock Frequency = ");
  Serial.println(HAL_RCC_GetHCLKFreq());
  Serial.println("=========================================");
  Serial.println("Setup start.");
#endif

  setupPort();
  setupEEPROM();
  setupSensors();
  setupBLE();

#ifdef DEBUG
  Serial.println("Setup finished.");
  Serial.println("=========================================");
#endif
}

/**
 * 
 */
void loop() {
  if (!bBleConnected) { // when BLE is not connected.
#ifdef DEBUG
    Serial.println("<<< Wake up <<<");
#endif

    wakeupSensors();
    wakeupBLE();

    getSensors();
    sleepSensors();

    writeEEPROM();

    StartAdvData();

    if (onClickedFlag) {  // onClicked Interrupt
      onClickedFlag = false;
#ifdef DEBUG
      Serial.println("STM32 on Clicked!");
      Serial.print("Start advertising ");
      Serial.print(click_wake_intval);
      Serial.println(" seconds.");
      Serial.flush();
#endif

      // Continue Advertising; (check BLE status every 0.1 secound.)
      for (int i = 0; i < click_wake_intval * 10; i++) {
        delay(100);
        // check ble status; if connection requested, my_evt_le_connection_opend handler is called.
        ble112.checkActivity();
      }

    } else {  // Normal operation
#ifdef DEBUG
      Serial.print("Start advertising (");
      Serial.print(wake_intval);
      Serial.println("s)");
#endif

      // Continue Advertising;
      for (int i = 0; i <= wake_intval * 10; i++) {
        delay(100);
        // don't check activity, if ble is not connectable during normal advertising operation.
        // ble112.checkActivity();
      }

      // bBleConnected turns true at this time, when the connection is requested;
    }

    // when the connection is not requested, shutdown all devices during SLEEP_INTERVAL seconds;
    if (!bBleConnected) {
      // accel.setClick(DOUBLE_TAP, CLICK_THRESHOLD); // Enable Interrupt
      accel.getClick();  // Enable Interrupt
      sleepAllDevices();
    }
  } else { // when ble is connected, this scope will run continuously.
    if (mode == MODE_SEND_DATA) {
#ifdef DEBUG
      Serial.println("Start to send data.");
#endif

      for (int i = RINGBUFF_OFFSET_ADDR; i < EEPROM.length(); i += PACKET_LENGTH) {
        char sendData[PACKET_LENGTH];

        for (int j=0; j<PACKET_LENGTH; j++) {
          sendData[j] = EEPROM.read(i + j);
        }
        ble112.ble_cmd_gatt_server_send_characteristic_notification(1, 0x000C, PACKET_LENGTH, (const uint8_t *)sendData);
        while (ble112.checkActivity(1000));
      }

#ifdef DEBUG
      Serial.println("Finish to send data.");
#endif

      // after all the data trasnported,
      ble112.ble_cmd_gatt_server_send_characteristic_notification(1, 0x000C, 6, (const uint8_t *)"finish");
      while (ble112.checkActivity(1000));
      mode = MODE_IDLE;
    }
    else if (mode == MODE_CLEAR_EEPROM) {
      for(int i = RINGBUFF_OFFSET_ADDR; i < EEPROM.length(); i++) {
        EEPROM.write(i, 0);
#ifdef DEBUG
        if (i % 10 == 0) {
          Serial.print(i);
          Serial.print("/");
          Serial.println(EEPROM.length() - RINGBUFF_OFFSET_ADDR);

          char sendData[PACKET_LENGTH];
          uint8_t len = sprintf(sendData, "%05d", i);
          ble112.ble_cmd_gatt_server_send_characteristic_notification(1, 0x000C, len, (const uint8_t *)sendData);
          while (ble112.checkActivity(1000));
        }
#endif
      }

      ble112.ble_cmd_gatt_server_send_characteristic_notification(1, 0x000C, 6, (const uint8_t *)"finish");
      while (ble112.checkActivity(1000));
      mode = MODE_IDLE;
    } else { // MODE_IDLE
      ble112.checkActivity(100);
    }
  }
}


// ================================================================
// INTERNAL BGLIB CLASS CALLBACK FUNCTIONS
// ================================================================

// called when the module begins sending a command
void onBusy()
{
}

// called when the module receives a complete response or "system_boot" event
void onIdle()
{
}

// called when the parser does not read the expected response in the specified time limit
void onTimeout()
{
  ble_state = BLE_STATE_STANDBY;
}

// called immediately before beginning UART TX of a command
void onBeforeTXCommand()
{
}

// called immediately after finishing UART TX
void onTXCommandComplete()
{
  // allow module to return to sleep (assuming here that digital pin 5 is connected to the BLE wake-up pin)
}

// called when the attribute value changed
void my_evt_gatt_server_attribute_value(const struct ble_msg_gatt_server_attribute_value_evt_t *msg)
{
  uint16 attribute = (uint16)msg->attribute;
  uint16 offset = 0;
  uint8 value_len = msg->value.len;

  uint8 value_data[20];
  String rcv_data;
  rcv_data = "";

  for (uint8_t i = 0; i < value_len; i++)
  {
    rcv_data += (char)(msg->value.data[i]);
  }

#ifdef DEBUG
  Serial.print("###\tgatt_server_attribute_value: { ");
  Serial.print("connection: ");
  Serial.print(msg->connection, HEX);
  Serial.print(", attribute: ");
  Serial.print((uint16_t)msg->attribute, HEX);
  Serial.print(", att_opcode: ");
  Serial.print(msg->att_opcode, HEX);
  Serial.print(", offset: ");
  Serial.print((uint16_t)msg->offset, HEX);
  Serial.print(", value_len: ");
  Serial.print(msg->value.len, HEX);
  Serial.print(", value_data: ");
  Serial.print(rcv_data);
  Serial.println(" }");
#endif

  // Received BLE Commands
  if (rcv_data.startsWith("getData"))
  {
    // Start to send EEPROM data
    mode = MODE_SEND_DATA;
  }
  else if (rcv_data.startsWith("getRomSize"))
  {
    char sendData[8];
    uint8_t len = sprintf(sendData, "%06d", EEPROM.length());
    ble112.ble_cmd_gatt_server_send_characteristic_notification(1, 0x000C, len, (const uint8_t *)sendData);
    while (ble112.checkActivity(1000));
  }
  else if (rcv_data.startsWith("getSleep"))
  {
    // send SLEEP_INTERVAL
    char sendData[8];
    uint8_t len = sprintf(sendData, "%05d", (int)sleep_intval);
    ble112.ble_cmd_gatt_server_send_characteristic_notification(1, 0x000C, len, (const uint8_t *)sendData);
    while (ble112.checkActivity(1000));
  }
  else if (rcv_data.startsWith("getWake"))
  {
    // send WAKE_INTERVAL
    char sendData[8];
    uint8_t len = sprintf(sendData, "%05d", (int)wake_intval);
    ble112.ble_cmd_gatt_server_send_characteristic_notification(1, 0x000C, len, (const uint8_t *)sendData);
    while (ble112.checkActivity(1000));
  }
  else if (rcv_data.startsWith("getSensFreq"))
  {
    // send SENS_FREQ
    char sendData[8];
    uint8_t len = sprintf(sendData, "%05d", (int)sens_freq);
    ble112.ble_cmd_gatt_server_send_characteristic_notification(1, 0x000C, len, (const uint8_t *)sendData);
    while (ble112.checkActivity(1000));
  }
  else if (rcv_data.startsWith("getSaveFreq"))
  {
    // send SAVE_FREQ
    char sendData[8];
    uint8_t len = sprintf(sendData, "%05d", (int)save_freq);
    ble112.ble_cmd_gatt_server_send_characteristic_notification(1, 0x000C, len, (const uint8_t *)sendData);
    while (ble112.checkActivity(1000));
  }
  else if (rcv_data.startsWith("setSleep"))
  {
    // rcv_data = "setSleep <SLEEP_INTERVAL>"
    uint16_t num = rcv_data.substring(9).toInt();
    EEPROM.write(4, (num >> 8) & 0xFF); // sleep_intval
    EEPROM.write(5, (num & 0xFF));      // sleep_intval
    sleep_intval = num;
    #ifdef DEBUG
    Serial.print("Sleep interval is changed. (");
    Serial.print(num);
    Serial.println("s)");
    #endif
  }
  else if (rcv_data.startsWith("setWake"))
  {
    // rcv_data = "setWake <WAKE_INTERVAL>"
    uint16_t num = rcv_data.substring(8).toInt();
    EEPROM.write(2, (num >> 8) & 0xFF);  // wake_intval
    EEPROM.write(3, (num & 0xFF));       // wake_intval
    wake_intval = num;
    #ifdef DEBUG
    Serial.print("Wake interval is changed. (");
    Serial.print(num);
    Serial.println("s)");
    #endif
  }
  else if (rcv_data.startsWith("setSensFreq"))
  {
    // rcv_data = "setSensFreq <SENS_FREQUENCY>"
    uint16_t num = rcv_data.substring(12).toInt();
    EEPROM.write(6, (num >> 8) & 0xFF);  // sens_freq
    EEPROM.write(7, (num & 0xFF));       // sens_freq
    #ifdef DEBUG
    Serial.print("Sens frequency is changed. (");
    Serial.print(num);
    Serial.println("s)");
    #endif
  }
  else if (rcv_data.startsWith("setSaveFreq"))
  {
    // rcv_data = "setSaveFreq <SAVE_FREQUENCY>"
    uint16_t num = rcv_data.substring(12).toInt();
    EEPROM.write(8, (num >> 8) & 0xFF);  // save_freq
    EEPROM.write(9, (num & 0xFF));  // save_freq
    #ifdef DEBUG
    Serial.print("Save frequency is changed. (");
    Serial.print(num);
    Serial.println("s)");
    #endif
  }
  else if (rcv_data.startsWith("setDevName"))
  {
    String rcvUniqueName = rcv_data.substring(11);

